MixingTank/OpenFoam/constant/turbulenceProperties.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;

RAS
{
    RASModel mixtureKEpsilon; // continuousGasKEpsilon;

    turbulence      on;
    printCoeffs     on;

    // mixtureKEpsilonCoeffs
    // {
    //     Cp  1;
    //     C3  1;
    // }
}

// ************************************************************************* //
